In [7]:
import numpy as np
import matplotlib.pyplot as plt
import pandas as pd

ds = pd.read_csv('C:\\Users\\jayak\\OneDrive\\Desktop\\Data Analytics\Example.csv')

<>:5: SyntaxWarning: invalid escape sequence '\E'
<>:5: SyntaxWarning: invalid escape sequence '\E'
C:\Users\jayak\AppData\Local\Temp\ipykernel_7748\3807176500.py:5: SyntaxWarning: invalid escape sequence '\E'
  ds = pd.read_csv('C:\\Users\\jayak\\OneDrive\\Desktop\\Data Analytics\Example.csv')

In [9]:
ds.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 20 entries, 0 to 19
Data columns (total 5 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   ID          20 non-null     int64
 1   Name        19 non-null     object
 2   Age         18 non-null     float64
 3   Salary      18 non-null     float64
 4   Department  20 non-null     object
dtypes: float64(2), int64(1), object(2)
memory usage: 932.0+ bytes

In [10]:
print(ds.isnull().sum())

ID            0
Name          1
Age           2
Salary        2
Department    0
dtype: int64

In [18]:
u_ds = ds.dropna(axis=0)

In [19]:
u_ds.info()

<class 'pandas.core.frame.DataFrame'>
Index: 15 entries, 0 to 19
Data columns (total 5 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   ID          15 non-null     int64
 1   Name        15 non-null     object
 2   Age         15 non-null     float64
 3   Salary      15 non-null     float64
 4   Department  15 non-null     object
dtypes: float64(2), int64(1), object(2)
memory usage: 720.0+ bytes

In [20]:
ds.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 20 entries, 0 to 19
Data columns (total 5 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   ID          20 non-null     int64
 1   Name        19 non-null     object
 2   Age         18 non-null     float64
 3   Salary      18 non-null     float64
 4   Department  20 non-null     object
dtypes: float64(2), int64(1), object(2)
memory usage: 932.0+ bytes

In [22]:
ds['Age'].mean()

33.94444444444444

In [23]:
ds['Age'].median()

31.5

In [25]:
up_ds = ds
up_ds['Age']=up_ds['Age'].fillna(ds['Age'].mean())

In [26]:
up_ds.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 20 entries, 0 to 19
Data columns (total 5 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   ID          20 non-null     int64
 1   Name        19 non-null     object
 2   Age         20 non-null     float64
 3   Salary      18 non-null     float64
 4   Department  20 non-null     object
dtypes: float64(2), int64(1), object(2)
memory usage: 932.0+ bytes

In [27]:
ds['Salary'].mean()

68222.22222222222

In [28]:
ds['Salary'].median()

54500.0

In [29]:
ups_ds = ds
ups_ds['Salaray'] = ups_ds['Salary'].fillna(ds['Salary'].mean())

In [30]:
ups_ds.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 20 entries, 0 to 19
Data columns (total 6 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   ID          20 non-null     int64
 1   Name        19 non-null     object
 2   Age         20 non-null     float64
 3   Salary      18 non-null     float64
 4   Department  20 non-null     object
 5   Salaray     20 non-null     float64
dtypes: float64(3), int64(1), object(2)
memory usage: 1.1+ KB

In [31]:
dm = pd.read_csv('C:\\Users\\jayak\\OneDrive\\Desktop\\Data Analytics\Example.csv')

<>:1: SyntaxWarning: invalid escape sequence '\E'
<>:1: SyntaxWarning: invalid escape sequence '\E'
C:\Users\jayak\AppData\Local\Temp\ipykernel_7748\3992148593.py:1: SyntaxWarning: invalid escape sequence '\E'
  dm = pd.read_csv('C:\\Users\\jayak\\OneDrive\\Desktop\\Data Analytics\Example.csv')

In [32]:
dm.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 20 entries, 0 to 19
Data columns (total 5 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   ID          20 non-null     int64
 1   Name        19 non-null     object
 2   Age         18 non-null     float64
 3   Salary      18 non-null     float64
 4   Department  20 non-null     object
dtypes: float64(2), int64(1), object(2)
memory usage: 932.0+ bytes

In [37]:
dm1 = dm

In [38]:
dm1['Age'] = dm['Age'].bfill()

In [40]:
dm1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 20 entries, 0 to 19
Data columns (total 5 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   ID          20 non-null     int64
 1   Name        19 non-null     object
 2   Age         20 non-null     float64
 3   Salary      18 non-null     float64
 4   Department  20 non-null     object
dtypes: float64(2), int64(1), object(2)
memory usage: 932.0+ bytes

In [41]:
ds.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 20 entries, 0 to 19
Data columns (total 6 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   ID          20 non-null     int64
 1   Name        19 non-null     object
 2   Age         20 non-null     float64
 3   Salary      18 non-null     float64
 4   Department  20 non-null     object
 5   Salaray     20 non-null     float64
dtypes: float64(3), int64(1), object(2)
memory usage: 1.1+ KB

In [53]:
from sklearn.preprocessing import StandardScaler
from sklearn.preprocessing import MinMaxScaler

In [43]:
ds.head()

   ID             Name        Age   Salary   Department       Salaray
0   1         John Doe  28.000000  50000.0  Engineering  50000.000000
1   2       Jane Smith  35.000000      NaN    Marketing  68222.222222
2   3  Michael Johnson  33.944444  45000.0  Engineering  45000.000000
3   4      Emily Davis  22.000000  52000.0        Sales  52000.000000
4   5              NaN  30.000000  49000.0    Marketing  49000.000000

In [44]:
ds.describe()

             ID        Age         Salary        Salaray
count  20.00000  20.000000      18.000000      20.000000
mean   10.50000  33.944444   68222.222222   68222.222222
std     5.91608   7.022312   31204.365373   29516.374680
min     1.00000  22.000000   45000.000000   45000.000000
25%     5.75000  29.000000   50250.000000   50750.000000
50%    10.50000  32.500000   54500.000000   57500.000000
75%    15.25000  37.250000   68000.000000   68666.666667
max    20.00000  50.000000  150000.000000  150000.000000

In [45]:
new_ds=pd.DataFrame(ds,columns=['Age','Salary'])

In [46]:
new_ds.head()

         Age   Salary
0  28.000000  50000.0
1  35.000000      NaN
2  33.944444  45000.0
3  22.000000  52000.0
4  30.000000  49000.0

In [49]:
new_ds['Salary'] = new_ds['Salary'].fillna(new_ds['Salary'].mean())

In [51]:
new_ds.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 20 entries, 0 to 19
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Age     20 non-null     float64
 1   Salary  20 non-null     float64
dtypes: float64(2)
memory usage: 452.0 bytes

In [59]:
scalar = MinMaxScaler()
stan_ds = scalar.fit_transform(new_ds)
print(stan_ds)

[[0.21428571 0.04761905]
 [0.46428571 0.22116402]
 [0.4265873  0.        ]
 [0.         0.06666667]
 [0.28571429 0.03809524]
 [0.82142857 0.71428571]
 [0.25       0.08571429]
 [0.57142857 0.14285714]
 [1.         0.23809524]
 [0.64285714 0.80952381]
 [0.32142857 0.0952381 ]
 [0.39285714 0.16190476]
 [0.17857143 0.02857143]
 [0.4265873  0.14285714]
 [0.85714286 0.23809524]
 [0.53571429 0.22116402]
 [0.25       0.07619048]
 [0.35714286 0.05714286]
 [0.21428571 0.03809524]
 [0.32142857 1.        ]]

In [68]:
scaler = StandardScaler()
stand_ds = scaler.fit_transform(new_ds)

In [69]:
print(new_ds)

          Age         Salary
0   28.000000   50000.000000
1   35.000000   68222.222222
2   33.944444   45000.000000
3   22.000000   52000.000000
4   30.000000   49000.000000
5   45.000000  120000.000000
6   29.000000   54000.000000
7   38.000000   60000.000000
8   50.000000   70000.000000
9   40.000000  130000.000000
10  31.000000   55000.000000
11  33.000000   62000.000000
12  27.000000   48000.000000
13  33.944444   60000.000000
14  46.000000   70000.000000
15  37.000000   68222.222222
16  29.000000   53000.000000
17  32.000000   51000.000000
18  28.000000   49000.000000
19  31.000000  150000.000000